/*
Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.

2, 3, 7 -> 7
44 5 78 -> 78
22 3 9 -> 22
*/

//==============================================================================================================================================

//Решение в общем случае:

/*
Console.WriteLine("Сколько чисел вы хотите сравнить, введите целое число: ");
int num = int.Parse(Console.ReadLine()!);
double[] numArray = new double[num];
double max = 0;

for (int i = 0; i < numArray.Length; i++){
    int element = i + 1;
    Console.WriteLine("Введите " + element + "-е число: ");
    numArray[i] = double.Parse(Console.ReadLine()!);
}

for (int i = 0; i < numArray.Length; i++){
    if (numArray[i] > max){
        max = numArray[i];
    }
}

Console.WriteLine("max = " + max);
*/

//==============================================================================================================================================