// IReadOnlyCollection<string> DaysOfWeek = new string[7] {"Sunday", "Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday"};
// Console.WriteLine("Какой сегодня день недели, введите число от 1 до 7: ");
// int index = int.Parse(Console.ReadLine()!);
// string day = DaysOfWeek.ElementAt(index - 1);
// Console.WriteLine("Сегодня " + day);

//==============================================================================================================================================

// Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).

// 4 -> да
// -3 -> нет
// 7 -> нет

//==============================================================================================================================================

//Решение в общем случае:
/*
Console.WriteLine("Введите целое число для проверки четности: ");
int num = int.Parse(Console.ReadLine()!);

if (num % 2 == 0){
    Console.WriteLine("Число " + num + " четное?\n" + "Ответ: да");
} else {
    Console.WriteLine("Число " + num + " четное?\n" + "Ответ: нет");
}
*/
//==============================================================================================================================================