// Задача 8: Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.

// 5 -> 2, 4
// 8 -> 2, 4, 6, 8

//==============================================================================================================================================

//Решение в общем случае:

Console.WriteLine("Введите целое число в пределах от 1 до требуемого значения для получения всех четных в этом диапазоне: ");
int num = int.Parse(Console.ReadLine()!);
int[] arrayNum = new int[num / 2];
int num2 = 2;

for (int i = 0; i < arrayNum.Length; i++){
    arrayNum[i] = num2;
    num2 += 2;
    if (i < arrayNum.Length - 1){
        Console.Write(arrayNum[i] + ", ");
    } else {
        Console.Write(arrayNum[i]);
    }
}

//==============================================================================================================================================